# импортируем настройки для отображения эмоджм
from .config import KEYBOARD, VERSION, AUTHOR

# ответ пользователю при нажатии кнопки "О магазине"
trading_store = """
<b>добро пожаловать в приложение GroceryStore!!!</b>
Данное приложение разработанно специально для торговых представителей
далее <i>(ТП/СВ</i>), а также для кладовщиков,
комерческих организаций осуществляющих оптово-розничную торговлю.

ТП используя приложение GroceryStore, в удобной интуитивной 
форме смогут без особого труда принять заказ от клиента.
GroceryStore поможет сформировать заказ и в удобном виде адресует кладовщику 
фирмы для дальнейшего комплектования заказа.
"""

# ответ пользователю при нажатии кнопки "О магазине"
settings = """
    <b>Общее руководство приложением:</b>
    
    <i>Навигация</i>
    
    -<b>({}) - </b><i>назад</i>
    -<b>({}) - </b><i>вперед</i>
    -<b>({}) - </b><i>увеличить</i>
    -<b>({}) - </b><i>уменьшить</i>
    -<b>({}) - </b><i>следующий</i>
    -<b>({}) - </b><i>предыдущий</i>
    
    <i>Специальные кнопки</i>
    
    -<b>({}) - </b><i>удалить</i>
    -<b>({}) - </b><i>заказ</i>
    -<b>({}) - </b><i>Оформить заказ</i>
    
    <i>Общая информация</i>
    
    -<b>версия программы - </b><i>({})</i>
    -<b>разработчик - </b><i>({})</i>
    -{} GroceryStore
    """.format(KEYBOARD['<<'],
               KEYBOARD['>>'],
               KEYBOARD['UP'],
               KEYBOARD['DOWN'],
               KEYBOARD['NEXT_STEP'],
               KEYBOARD['BACK_STEP'],
               KEYBOARD['X'],
               KEYBOARD['ORDER'],
               KEYBOARD['APPLY'],
               VERSION,
               AUTHOR,
               KEYBOARD['COPY'])

# ответ пользователю при добавлении товара в заказ
product_order = """
Выбраный товар:

{}
{}
Стоимость: {} руб

добавлен в заказ!!!
На складе осталось {} ед.
"""

# ответ пользователю при посещении блока с заказом
order = """
<i>Название:</i><b>{}</b>

<i>Описание:</i><b>{}</b>

<i>Стоимость:</i><b>{} руб за 1 ед.</b>

<i>Количество розиций:</i><b>{} ед.</b>
"""

order_number = """
<b>Позиция в заказе № </b><i>{}</i>
"""

# ответ пользователю когда заказа нет
no_orders = """
<b> Заказ отсутствует!!!</b>
"""

applay = """
<b>Ваш заказ оформлен!!!</b>

<i>Общая стоимость заказа состовляет:</i><b>{} руб.</b>

<i>Общее количество позиций состовляет:</i><b>{} ед.</b>

<b>ЗАКАЗ ОТПРАВЛЕН НА СКЛАД, ДЛЯ ЕГО КОМПЛЕКТОВКИ</b>
"""

MESSAGES = {
    'trading_store': trading_store,
    'product_order': product_order,
    'order': order,
    'order_number': order_number,
    'no_orders': no_orders,
    'applay': applay,
    'settings': settings
}
